# Exploring Data From the Web

### Introduction

In the last lesson, we saw how to collect some of our live data from the web.  In this lesson, let's try to use our skills to collect some data about NBA players.  Without further ado...

### Collecting Data

Now the first step is to load up our pandas library into our current coding environment.  We want to able to reference that library with the variable, or alias `pd`.

In [2]:
import pandas as pd

You'll know that it's working if you can type `pd.` tab, and see a list of methods.

In [ ]:
pd.

Next we would like to use read our html from a specified URL.  We'll provide the url for you below.  You will need to use this url, combined with the correct pandas method to read the tables.  Store the result as `list_of_tables`.  There is only one table on the page.

In [3]:
url = 'https://www.espn.com/nba/team/roster/_/name/lal/los-angeles-lakers'
list_of_tables = pd.read_html(url)


len(list_of_tables)

# 1

1

Let's select that first table, and store it as player table.  This is our pandas dataframe.

In [4]:
player_table = list_of_tables[0]
player_table[:3]

# 	Unnamed: 0	Name	POS	Age	HT	WT	College	Salary
# 0	NaN	Patrick Beverley21	PG	34	6' 1"	180 lbs	Arkansas	$13,000,000
# 1	NaN	Sterling Brown23	SF	27	6' 5"	219 lbs	SMU	$3,000,000
# 2	NaN	Troy Brown Jr.7	SF	23	6' 6"	215 lbs	Oregon	$1,836,090

,Unnamed: 0,Name,POS,Age,HT,WT,College,Salary
0,NaN,Patrick Beverley21,PG,34,"6' 1""",180 lbs,Arkansas,"$13,000,000"
1,NaN,Sterling Brown23,SF,27,"6' 5""",219 lbs,SMU,"$3,000,000"
2,NaN,Troy Brown Jr.7,SF,23,"6' 6""",215 lbs,Oregon,"$1,836,090"

Now, because we don't really know how to work with a pandas dataframe, let's convert this to a list of dictionaries and store it in the variable `players`.  Here we'll help you.  We can do this with the line `player_table.to_dict('records')`.

In [5]:
players = player_table.to_dict('records')

So `players` is a list of dictionaries, and just like any list, we can select the first couple of elements by slicing the list like so.

In [6]:
players[0:2]

[{'Unnamed: 0': nan,
  'Name': 'Patrick Beverley21',
  'POS': 'PG',
  'Age': 34,
  'HT': '6\' 1"',
  'WT': '180 lbs',
  'College': 'Arkansas',
  'Salary': '$13,000,000'},
 {'Unnamed: 0': nan,
  'Name': 'Sterling Brown23',
  'POS': 'SF',
  'Age': 27,
  'HT': '6\' 5"',
  'WT': '219 lbs',
  'College': 'SMU',
  'Salary': '$3,000,000'}]

Ok, looks pretty good.

### Exploring our data

Ok, so now it's time to explore some of our data.  Remember that `players` is just a list.  Begin by slicing the first three elements from the list.

In [ ]:
first_three = None
len(first_three)

# 3

Next, select the third player in the list, and select that player's salary.

In [7]:
last_salary = None
last_salary

# '$1,836,090'

'$1,836,090'

Select the third player's height.

In [8]:
third_height = None
third_height
# '6\' 6"

'6\' 6"'

### Summary

In this lesson, we saw how to gather some live data from the web.  We did this with the following steps:

1. Load the pandas library
2. Read the list of tables from the web
3. Select the relevant table from our list
4. Convert that table to a list of dictionaries with `table.to_dict('records')`

From there, we can use our list of dictionaries to explore our data.